%**********************************自变量逐步回归选择*******************************%**
function In=zbhg(num)
%多元逐步回归,本程序在MATLAB2008a下运行通过.


%XY=[x1 x2 x3 ... xn y]，先x后y按列排列的数组
% XY=[13,7,26,19,11.5;15,11,40,34,19.8;21,8,29,17,13.7;19,12,15,33,21.6;27,11,13,27,22.3;32,10,21,15,19.1;
% 	17,8,18,16,11.7;26,10,35,23,19.4;14,6,14,18,10.6;28,13,21,34,25.5;19,9,13,29,18.7;12,10,19,38,19.3;
% 	23,8,25,17,15.6;28,11,33,32,24.7;21,9,18,19,15.3;35,14,24,34,29.8;16,6,19,14,10.2;24,10,32,26,19.8;
% 	22,11,39,38,25.3;10,7,17,20,9.7;18,8,34,22,14.8;29,11,28,21,20.7;18,11,16,32,19.6;16,10,15,34,20.3;
% 	18,7,23,14,11.1;23,11,29,29,20.7;25,13,41,40,28.9;32,9,12,15,18.3;36,11,37,18,21.5;31,9,25,14,17.7;
% 	29,13,14,38,28.3;18,10,11,35,21.6];


XY=num;
[m,n]=size(XY);
n=n-1;%自变量个数
f=0;%引入变量个数
s=0;%计算步数
mXY=mean(XY);%求各列平均值
L=XY'*XY-m*mXY'*mXY;%计算离差阵L(n+1,n+1)
%计算相关系数阵R(n+1,n+1)
R=diag(1./sqrt(diag(L)));
R=R*L*R;
In=[];%已引入的所有变量下标索引数组
Out=1:n;%未引入的所有变量下标索引数组

Fin=0.65;%input('F进=');%F进
Fin=finv(Fin,1,m-2);
Fout=0.6;%input('F出=');%F出
Fout=finv(Fout,1,m-2);

disp('开始逐步回归计算:');
while 1
%计算引入变量的偏回归平方和，和未引入变量的引入贡献
P=R(1:n,end).^2./diag(R(1:n,1:n));
if s>1
    [pmin,imin]=min(P(In));%寻找已引入自变量方差贡献的最小值和索引
    Fx=(m-f-1)*pmin/R(end,end);%计算待剔除变量的F检验值
    if Fx<=Fout
        s=s+1;        
        disp(sprintf('=====================第%d步=====================',s));
        disp(sprintf('变量x%d被剔除,F%d=%f<=F出=%f',In(imin),In(imin),Fx,Fout));        
        R=T(R,In(imin));%消去变换
        Out(end+1)=In(imin);%将剔除的变量下标加入未引入变量索引数组
        In(imin)=[];%将剔除的变量下标从引入变量索引数组中删除            
        f=f-1;%引入变量个数减一
        continue;
    end
end
[pmax,imax]=max(P(Out));%寻找未引入变量方差贡献最大值和索引
Fx=(m-f-2)*pmax/(R(end,end)-pmax);%计算待选入变量的F检验值
if Fx>=Fin
    s=s+1;    
    disp(sprintf('=====================第%d步=====================',s));
    disp(sprintf('变量x%d被选入,F%d=%f>=F进=%f',Out(imax),Out(imax),Fx,Fin));     
    R=T(R,Out(imax));%消去变换
    In(end+1)=Out(imax);%将选入的变量下标加入引入变量索引数组
    Out(imax)=[];%将选入的变量下标从未引入变量索引数组中删除
    f=f+1;%引入变量个数加一
    continue;
end 
disp(sprintf('=====================第%d步=====================',s+1));
disp('既不能选入，也不能剔除，结束逐步计算.');
break;
end
In=sort(In);%将选入的变量下标进行排序
B=R(In,end).*sqrt(L(end,end)./diag(L(In,In)));%选入变量的系数
b0=mXY(end)-mXY(In)*B;%常数项

disp('回归方程:');
disp(sprintf('y=%f%s',b0,sprintf('%+fx%d',[B';In])));%显示回归方程
disp(['残差平方和 Q = ' num2str(L(end,end)*R(end,end))])
disp(['误差均方根 S = ' num2str(sqrt(L(end,end)*R(end,end)/(m)))])
disp(['复相关系数 R = ' num2str(sqrt(1-R(end,end)))]) 
disp(['回归方程显著性检验 F = ' num2str((m-f-1)*(1-R(end,end))/(f*R(end,end)))])
CC=diag(R(In,In))*R(end,end);
disp(['各回归系数的t检验值:',sprintf('%10f\t',R(In,end)./sqrt(CC/(m-f-1)))])
%disp(['引入变量的偏相关系数:',sprintf('%10f\t',R(In,end)./sqrt(CC+R(In,end).^2)
%)])%%这貌似错了吧
%disp('B:');
In
%B=[b0;B];
%-------------------------------------------------------------------------
function  R=T(R,k)
%消去变换
[n,n]=size(R);
%i~=k,j~=k
R([1:k-1,k+1:n],[1:k-1,k+1:n])=R([1:k-1,k+1:n],[1:k-1,k+1:n])...
    -R([1:k-1,k+1:n],k)*R(k,[1:k-1,k+1:n])/R(k,k);
R([1:k-1,k+1:n],k)=-R([1:k-1,k+1:n],k)/R(k,k);%i~=k,j==k
R(k,[1:k-1,k+1:n])=R(k,[1:k-1,k+1:n])/R(k,k);%i==k,j~=k
R(k,k)=1/R(k,k);%i==k,j==k

