%----------感知机算法----------
%决策函数：sign(W*X+b);>0为1类，<0为-1类。
%适用二分类
%线性分类模型
%线性可分时，能收敛；线性不可分时，震荡。
%最优化问题：minL(w,b)=-累加yi(W*Xi+b)
%-----------------------------------------------------
% 输入：X(x1,x2,...xm)=[n*m];Y(y1)=[n*1]=[1;-1;1;1;-1;...];

% 输出：W=[w1,w2,..wm]=[1*m],b=[b0]=[1*1]

function [W,b]=perceptron(X,Y,ECHO)

[n,m]=size(X);

W=zeros(m,1);
b=0;
eta=0.7;%梯度下降速率系数
i=1;
    j=1;
   while(j<=n)
    temp=(X(j,:)*W+b)*Y(j);  %判断分类准确性的函数
    
   
    if temp<=0      %分类错误就更新W,b
        W=W+eta*Y(j)*X(j,:)';
        b=b+eta*Y(j);
        j=0;
        
        
        i=i+1;
        if i>ECHO %更新次数达到最大限制
            break;
        end
        
    end
    j=j+1;
   end
   

    


end
